let data = [
  // {
  //   _id: "re01-数字版",
  //   course: "从零开始的编程之路",
  //   sort: 1,
  //   title: "课程文稿版",
  //   description:
  //     "我发布课程的文字稿，购买时务必填写你的飞书昵称和手机号。购买后可在我的订单页面看到邀请链接，自行使用该链接申请加入专属空间，经审批后会开通飞书知识空间权限，看到视频课的文字稿，包含历史版本、删减段落、参考资料等原始文稿。随视频课进度更新。",
  //   total: 9900,
  //   name: true,
  //   phone: true,
  // },
  // {
  //   _id: "re01-模板授权",
  //   course: "从零开始的编程之路",
  //   sort: 2,
  //   title: "简历+博客源码仓库权限和授权",
  //   description:
  //     "五套个人简历网站源码，五套博客网站源码，由专业设计师设计，每套价值5000元。购买后请至我的订单页面查看项目代码仓库邀请链接，注册后完善你的用户名，和下单时相同，经过审批后即可加入并看到项目仓库源码。",
  //   total: 19900,
  //   name: true,
  //   phone: true,
  // },
  // {
  //   _id: "re01-项目授权",
  //   course: "从零开始的编程之路",
  //   sort: 3,
  //   title: "元岛项目源码仓库权限和授权",
  //   description:
  //     "一套价值百万的元岛项目源码及个人使用授权。购买后请至我的订单页面查看项目代码仓库邀请链接，注册后完善你的用户名，和下单时相同，经过审批后即可加入并看到项目仓库源码。",
  //   total: 29900,
  //   name: true,
  //   phone: true,
  // },
  // {
  //   _id: "re01-会员卡",
  //   course: "从零开始的编程之路",
  //   sort: 1,
  //   title: "永久会员包",
  //   description: "包含后续的托管服务，会员标志一份加1。每份赠送1贡献。",
  //   total: 1000,
  //   share: 1,
  // },
  // {
  //   _id: "re01-畅行卡",
  //   course: "从零开始的编程之路",
  //   sort: 6,
  //   title: "答疑资料包",
  //   description:
  //     "课程所有章节的答疑, 学习分享, 以及直升14级的权限(适用于已有一定经验或者懒得交作业的同学)。",
  //   total: 9900,
  // },
  // {
  //   _id: "re01-贡献包",
  //   course: "从零开始的编程之路",
  //   sort: 7,
  //   title: "课程资料包",
  //   description: "自定义支持课程资料包。每份赠送1金币。",
  //   total: 100,
  //   coin: 1,
  // },
];
module.exports = async (args, db, userId, ctx) => {
  return {
    data,
  };
  // return await db
  //   .collection("sku")
  //   .where({
  //     course: args.course || "从零开始的编程之路",
  //   })
  //   .orderBy("sort", "asc")
  //   .get();
};
